# Markdown

# Заголовок #
### Заголовок h3  
###### Заголовок h5

### Списки

- Элемент 1
- Элемент 2 
- Элемент 3
    * Вложенный элемент 3.1    
    * Вложенный элемент 3.2
- Элемент 4

### Цитаты

> Цитата ...  
>   конец цитаты.

### Исходный код

    <codecodecode>
        <www>
        </www>
    </codecodecode>

***

[ссылка](http://example.com/link)

![](//placehold.it/150x100)

# NumPy

In [58]:
import numpy as np

In [58]:
vec = np.array([1,2,3])
vec.ndim # количество осей

1

In [68]:
mat = np.array([[1,2,3],[4,5,6]])
mat.ndim

2

In [69]:
vec.shape

(3,)

In [70]:
mat.dtype.name

'int32'

In [71]:
mat.itemsize

4

# Создание массивов

In [73]:
A = np.array([1,2,3])
A

array([1, 2, 3])

In [74]:
A = np.array([1,2,3], dtype = float)
A

array([1., 2., 3.])

In [76]:
B = np.array([(1,2,3),(4,5,6)])
B

array([[1, 2, 3],
       [4, 5, 6]])

In [77]:
np.zeros((3,))

array([0., 0., 0.])

In [79]:
np.ones((3,4))

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.]])

In [81]:
np.identity(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [82]:
np.empty((2,5))

array([[1.20961330e-312, 0.00000000e+000, 1.06395697e+224,
        1.33693763e+165, 1.28920872e+165],
       [4.03819831e-037, 3.69554037e-033, 3.44117240e-085,
        3.51151606e+151, 1.24612044e-306]])

In [83]:
np.arange(2,20,3)

array([ 2,  5,  8, 11, 14, 17])

In [84]:
np.arange(2.5,8.7,0.9)

array([2.5, 3.4, 4.3, 5.2, 6.1, 7. , 7.9])

In [85]:
np.linspace(2,18,14)

array([ 2.        ,  3.23076923,  4.46153846,  5.69230769,  6.92307692,
        8.15384615,  9.38461538, 10.61538462, 11.84615385, 13.07692308,
       14.30769231, 15.53846154, 16.76923077, 18.        ])

In [86]:
np.arange(9).reshape(3,3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [87]:
np.arange(8).reshape(2,-1)

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [90]:
C = np.arange(6).reshape(2,-1)
C

array([[0, 1, 2],
       [3, 4, 5]])

In [91]:
C.T

array([[0, 3],
       [1, 4],
       [2, 5]])

In [92]:
A = np.arange(6).reshape(2,-1)
np.hstack((A,A**2))

array([[ 0,  1,  2,  0,  1,  4],
       [ 3,  4,  5,  9, 16, 25]])

In [94]:
np.vstack((A,A**2))

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 0,  1,  4],
       [ 9, 16, 25]])

In [95]:
np.concatenate((A,A**2),axis = 1)

array([[ 0,  1,  2,  0,  1,  4],
       [ 3,  4,  5,  9, 16, 25]])

In [97]:
a = np.arange(3)
np.tile(a,(2,2))

array([[0, 1, 2, 0, 1, 2],
       [0, 1, 2, 0, 1, 2]])

In [98]:
np.tile(a,(4,1))

array([[0, 1, 2],
       [0, 1, 2],
       [0, 1, 2],
       [0, 1, 2]])

# Базовые операции

In [4]:
A = np.arange(9).reshape(3,3)
B = np.arange(1,10).reshape(3,3)

In [5]:
print(A)
print(B)

[[0 1 2]
 [3 4 5]
 [6 7 8]]
[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [6]:
A + B

array([[ 1,  3,  5],
       [ 7,  9, 11],
       [13, 15, 17]])

In [7]:
A * 1.0 / B

array([[0.        , 0.5       , 0.66666667],
       [0.75      , 0.8       , 0.83333333],
       [0.85714286, 0.875     , 0.88888889]])

In [8]:
A + 1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [9]:
3 * A

array([[ 0,  3,  6],
       [ 9, 12, 15],
       [18, 21, 24]])

In [10]:
A ** 2

array([[ 0,  1,  4],
       [ 9, 16, 25],
       [36, 49, 64]], dtype=int32)

In [11]:
A * B

array([[ 0,  2,  6],
       [12, 20, 30],
       [42, 56, 72]])

In [12]:
A.dot(B)

array([[ 18,  21,  24],
       [ 54,  66,  78],
       [ 90, 111, 132]])

In [13]:
np.tile(np.arange(0,40,10),(3,1)).T + np.array([0,1,2])

array([[ 0,  1,  2],
       [10, 11, 12],
       [20, 21, 22],
       [30, 31, 32]])

In [14]:
np.exp(A)

array([[1.00000000e+00, 2.71828183e+00, 7.38905610e+00],
       [2.00855369e+01, 5.45981500e+01, 1.48413159e+02],
       [4.03428793e+02, 1.09663316e+03, 2.98095799e+03]])

In [15]:
A

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [16]:
A.min()

0

In [17]:
A.max(axis = 0)

array([6, 7, 8])

In [18]:
A.sum(axis = 1)

array([ 3, 12, 21])

# Индексация

In [20]:
a = np.arange(10)
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [21]:
a[2:5]

array([2, 3, 4])

In [22]:
a[3:8:2]

array([3, 5, 7])

In [24]:
A = np.arange(81).reshape(9,-1)
A

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8],
       [ 9, 10, 11, 12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23, 24, 25, 26],
       [27, 28, 29, 30, 31, 32, 33, 34, 35],
       [36, 37, 38, 39, 40, 41, 42, 43, 44],
       [45, 46, 47, 48, 49, 50, 51, 52, 53],
       [54, 55, 56, 57, 58, 59, 60, 61, 62],
       [63, 64, 65, 66, 67, 68, 69, 70, 71],
       [72, 73, 74, 75, 76, 77, 78, 79, 80]])

In [25]:
A[2:4]

array([[18, 19, 20, 21, 22, 23, 24, 25, 26],
       [27, 28, 29, 30, 31, 32, 33, 34, 35]])

In [26]:
A[:,2:4]

array([[ 2,  3],
       [11, 12],
       [20, 21],
       [29, 30],
       [38, 39],
       [47, 48],
       [56, 57],
       [65, 66],
       [74, 75]])

In [27]:
A[2:4, 2:4]

array([[20, 21],
       [29, 30]])

In [28]:
A[-1]

array([72, 73, 74, 75, 76, 77, 78, 79, 80])

In [29]:
A = np.arange(81).reshape(9,-1)
A

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8],
       [ 9, 10, 11, 12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23, 24, 25, 26],
       [27, 28, 29, 30, 31, 32, 33, 34, 35],
       [36, 37, 38, 39, 40, 41, 42, 43, 44],
       [45, 46, 47, 48, 49, 50, 51, 52, 53],
       [54, 55, 56, 57, 58, 59, 60, 61, 62],
       [63, 64, 65, 66, 67, 68, 69, 70, 71],
       [72, 73, 74, 75, 76, 77, 78, 79, 80]])

In [30]:
A[[2,4,5],[0,1,3]]

array([18, 37, 48])

In [31]:
A = np.arange(11)
A

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [32]:
A[A % 5 != 3]

array([ 0,  1,  2,  4,  5,  6,  7,  9, 10])

In [34]:
A[np.logical_and(A != 7, A % 5 != 3)]

array([ 0,  1,  2,  4,  5,  6,  9, 10])

# Pandas

In [53]:
import pandas as pd
my_series = pd.Series([5,6,7,8,9,10])
my_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [54]:
my_series.index

RangeIndex(start=0, stop=6, step=1)

In [55]:
my_series.values

array([ 5,  6,  7,  8,  9, 10], dtype=int64)

In [56]:
my_series[4]

9

In [57]:
my_series2 = pd.Series([5,6,7,8,9,10], index = ['a','b','c','d','e','f'])
my_series2['f']

10

In [58]:
my_series2[['a','b','f']]

a     5
b     6
f    10
dtype: int64

In [59]:
my_series2[['a','b','f']] = 0
my_series2

a    0
b    0
c    7
d    8
e    9
f    0
dtype: int64

In [60]:
my_series2[my_series2 > 0]

c    7
d    8
e    9
dtype: int64

In [61]:
my_series2[my_series2 > 0] * 2

c    14
d    16
e    18
dtype: int64

In [63]:
my_series3 = pd.Series({'a' : 5,'b' : 6, 'c': 7, 'd':8})
my_series3

a    5
b    6
c    7
d    8
dtype: int64

In [65]:
my_series3.name = 'numbers'
my_series3.index.name = 'letters'
my_series3

letters
a    5
b    6
c    7
d    8
Name: numbers, dtype: int64

In [66]:
my_series3.index = ['A','B','C','D']
my_series3

A    5
B    6
C    7
D    8
Name: numbers, dtype: int64

# Dataframe

In [68]:
df = pd.DataFrame({
    'country':['Kazskhstan','Russia','Belarus','Ukraine'],
    'population': [17.04,143.5,9.5,45.5],
    'square': [2724902,17145234,207600,603628]    
})
df

      country  population    square
0  Kazskhstan       17.04   2724902
1      Russia      143.50  17145234
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [69]:
df['country']

0    Kazskhstan
1        Russia
2       Belarus
3       Ukraine
Name: country, dtype: object

In [70]:
df.columns

Index(['country', 'population', 'square'], dtype='object')

In [71]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [72]:
df = pd.DataFrame({
    'country':['Kazskhstan','Russia','Belarus','Ukraine'],
    'population': [17.04,143.5,9.5,45.5],
    'square': [2724902,17145234,207600,603628]    
}, index = ['KZ','RU','BY','UA'])
df

       country  population    square
KZ  Kazskhstan       17.04   2724902
RU      Russia      143.50  17145234
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [74]:
df.index = ['KZ','RU','BY','UA']
df.index.name = 'Country Code'
df

                 country  population    square
Country Code
KZ            Kazskhstan       17.04   2724902
RU                Russia      143.50  17145234
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [76]:
df['country']

Country Code
KZ    Kazskhstan
RU        Russia
BY       Belarus
UA       Ukraine
Name: country, dtype: object

In [77]:
df.loc['KZ']

country       Kazskhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [78]:
df.iloc[0]

country       Kazskhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [79]:
df.loc[['KZ','RU'],'population']

Country Code
KZ     17.04
RU    143.50
Name: population, dtype: float64

In [80]:
df.loc['KZ':'BY',:]

                 country  population    square
Country Code
KZ            Kazskhstan       17.04   2724902
RU                Russia      143.50  17145234
BY               Belarus        9.50    207600

In [81]:
df[df.population > 10][['country','square']]

                 country    square
Country Code
KZ            Kazskhstan   2724902
RU                Russia  17145234
UA               Ukraine    603628

In [82]:
df.reset_index()

  Country Code     country  population    square
0           KZ  Kazskhstan       17.04   2724902
1           RU      Russia      143.50  17145234
2           BY     Belarus        9.50    207600
3           UA     Ukraine       45.50    603628

In [83]:
df['density'] = df['population'] / df['square'] * 1000000
df

                 country  population    square    density
Country Code
KZ            Kazskhstan       17.04   2724902   6.253436
RU                Russia      143.50  17145234   8.369673
BY               Belarus        9.50    207600  45.761079
UA               Ukraine       45.50    603628  75.377550

In [84]:
df.drop(['density'], axis = 'columns')

                 country  population    square
Country Code
KZ            Kazskhstan       17.04   2724902
RU                Russia      143.50  17145234
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [85]:
df = df.rename(columns = {'Country Code': 'country_code'})
df

                 country  population    square    density
Country Code
KZ            Kazskhstan       17.04   2724902   6.253436
RU                Russia      143.50  17145234   8.369673
BY               Belarus        9.50    207600  45.761079
UA               Ukraine       45.50    603628  75.377550

## Группировка и агрегирование в pandas

In [3]:
import pandas as pd
titanic_df = pd.read_csv('titanic.csv')
print(titanic_df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [4]:
print(titanic_df.groupby(['Sex','Survived'])['PassengerId'].count())

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: PassengerId, dtype: int64

In [5]:
print(titanic_df.groupby(['Pclass','Survived'])['PassengerId'].count())

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: PassengerId, dtype: int64

In [8]:
%matplotlib inline

In [10]:
pass_data = pd.read_csv('titanic.csv')
pass_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
pass_data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
pass_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
pass_data[2:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [15]:
pass_data.iloc[1:5,1:4]

   Survived  Pclass                                               Name
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

In [17]:
pass_data['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [18]:
pass_data[['Name','Sex',"Parch"]].head()

                                                Name     Sex  Parch
0                            Braund, Mr. Owen Harris    male      0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female      0
2                             Heikkinen, Miss. Laina  female      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female      0
4                           Allen, Mr. William Henry    male      0

In [19]:
pass_data[pass_data['Sex'] == 'female'].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [20]:
pass_data[(pass_data['Sex'] == 'female') & (pass_data['Age'] >= 60) | (pass_data['Sex'] == 'male')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [28]:
def get_last_name(name):
    return name.split(',')[0].strip()

last_names = pass_data['Name'].apply(get_last_name)
last_names.head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [33]:
pass_data['Last_name'] = last_names
pass_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen

In [34]:
pass_data.drop('Last_name',axis = 1, inplace = True)
pass_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [39]:
pass_data.sort_values(by=['Pclass','Fare'],ascending = True).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S

In [40]:
pass_data.sort_values(by=['Pclass','Fare'],ascending = [True,False]).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S

## Группировка данных

In [43]:
pass_data.groupby('Sex')

In [45]:
pass_data.groupby('Sex')['Pclass'].value_counts()

Sex     Pclass
female  3         144
        1          94
        2          76
male    3         347
        1         122
        2         108
Name: Pclass, dtype: int64

In [46]:
pass_data.groupby('Pclass')['Fare'].describe()

        count       mean        std  min       25%      50%   75%       max
Pclass
1       216.0  84.154687  78.380373  0.0  30.92395  60.2875  93.5  512.3292
2       184.0  20.662183  13.417399  0.0  13.00000  14.2500  26.0   73.5000
3       491.0  13.675550  11.778142  0.0   7.75000   8.0500  15.5   69.5500

In [47]:
pass_data.groupby('Pclass')['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [50]:
pass_data.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [51]:
pass_data.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [52]:
pass_data.groupby('Sex', as_index = False)['Survived'].mean()

      Sex  Survived
0  female  0.742038
1    male  0.188908

## Apply

In [56]:
df = pd.DataFrame([[4,9],] * 3, columns = ['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [59]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [60]:
df.apply(np.sum,axis = 0)

A    12
B    27
dtype: int64

In [61]:
df.apply(np.sum,axis = 1)

0    13
1    13
2    13
dtype: int64

In [66]:
df = pd.DataFrame(np.random.randn(3,3))
df

          0         1         2
0  1.401302  0.653366 -0.585461
1 -0.416095 -0.473374  0.471326
2  0.948288 -0.800511 -0.756901

In [68]:
df = df.applymap(lambda x: '%.2f' % x)
df

       0      1      2
0   1.40   0.65  -0.59
1  -0.42  -0.47   0.47
2   0.95  -0.80  -0.76